# -*- coding: utf-8 -*-
import pandas as pd
import xlsxwriter


list = [[0, '경기도', '안산시단원구', '풍도동', '', ' <= DB 데이터 변경', '경기도', '안산시', '풍도동'], [1, '경기도', '파주시', '파평면', '눌노리', ' <= DB 데이터 변경', '경기도', '파주시', '파평면늘노리'], [2, '경상남도', '창원시마산합포구', '구산면', '마전리', ' <= DB 데이터 변경', '경상남도', '창원시', '구산면마전리'], [3, '경상남도', '창원시의창구', '북면', '하천리', ' <= DB 데이터 변경', '경상남도', '창원시', '북면하천리'], [4, '경상북도', '예천군', '효자면', '도촌리', ' <= DB 데이터 변경', '경상북도', '예천군', '상리면도촌리'], [5, '경상북도', '울진군', '금강송면', '광회리', ' <= DB 데이터 변경', '경상북도', '울진군', '서면광회리'], [6, '경상북도', '울진군', '금강송면', '삼근리', ' <= DB 데이터 변경', '경상북도', '울진군', '서면삼근리'], [7, '경상북도', '울진군', '금강송면', '왕피리', ' <= DB 데이터 변경', '경상북도', '울진군', '서면왕피리'], [8, '경상북도', '청송군', '부남면', '대전리', ' <= DB 데이터 변경', '경상북도', '청송군', '부동면이전리'], [9, '경상북도', '포항시북구', '죽장면', '상옥리', ' <= DB 데이터 변경', '경상북도', '포항시', '죽장면상옥리'], [10, '경상북도', '포항시북구', '흥해읍', '곡강리', ' <= DB 데이터 변경', '경상북도', '포항시', '흥해읍곡강리'], [11, '세종특별자치시', '', '연서면', '쌍류리', ' <= DB 데이터 변경', '세종특별자치시', '', '연서면쌍류리'], [12, '충청남도', '천안시동남구', '북면', '오곡리', ' <= DB 데이터 변경', '충청남도', '천안시', '북면오곡리'], [13, '충청북도', '청주시상당구', '미원면', '금관리', ' <= DB 데이터 변경', '충청북도', '청주시', '미원면금관리'], [14, '충청북도', '청주시상당구', '월오동', '', ' <= DB 데이터 변경', '충청북도', '청주시', '월오동']]


def export_date_excel():
    header = ['인덱스', '기준', '유사데이터']
    dataF = pd.DataFrame(list)
    print(dataF)
    filename = './excel_test.xlsx'
    dataF.to_excel(filename, 'Sheet1', index=False, engine='xlsxwriter')


export_date_excel()